ninjasstudio/micropython/ports/esp32/machine_pwm.c
STATIC void set_duty(machine_pwm_obj_t *self) {
    if (self->duty_x == HIGHEST_PWM_RES) {
        set_duty_u16(self, self->duty);
    } else if (self->duty_x == PWM_RES_10_BIT) {
        set_duty_u10(self, self->duty);
    } else if (self->duty_x == -HIGHEST_PWM_RES) {
        set_duty_ns(self, self->duty);
    }
}

// Set timer frequency
STATIC void set_freq(machine_pwm_obj_t *self, unsigned int freq) {
    ledc_timer_config_t *timer = &timers[self->mode][self->timer];
    if (timer->freq_hz != freq) {
        // Find the highest bit resolution for the requested frequency
        unsigned int i = LEDC_APB_CLK_HZ; // 80 MHz
        #if SOC_LEDC_SUPPORT_REF_TICK
        if (freq < EMPIRIC_FREQ) {
            i = LEDC_REF_CLK_HZ; // 1 MHz
        }
        #endif

        #if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(4, 4, 0)
        // original code
        i /= freq;
        #else
        // See https://github.com/espressif/esp-idf/issues/7722
        int divider = (i + freq / 2) / freq; // rounded
        if (divider == 0) {
            divider = 1;
        }
        float f = (float)i / divider; // actual frequency
        if (f <= 1.0) {
            f = 1.0;
        }
        i = (unsigned int)roundf((float)i / f);
        #endif

        unsigned int res = 0;
        for (; i > 1; i >>= 1) {
            ++res;
        }
        if (res == 0) {
            res = 1;
        } else if (res > HIGHEST_PWM_RES) {
            // Limit resolution to HIGHEST_PWM_RES to match units of our duty
            res = HIGHEST_PWM_RES;
        }

        // Configure the new resolution and frequency
        timer->duty_resolution = res;
        timer->freq_hz = freq;
        timer->clk_cfg = LEDC_USE_APB_CLK;
        #if SOC_LEDC_SUPPORT_REF_TICK
        if (freq < EMPIRIC_FREQ) {
            timer->clk_cfg = LEDC_USE_REF_TICK;
        }
        #endif

        // timer->duty_resolution !=

        MP_PRN(3, "mode=%d t=%d dr=%u freq=%u", timer->speed_mode, timer->timer_num, timer->duty_resolution, timer->freq_hz);
        // Set frequency
        check_esp_err(ledc_timer_config(timer));
        // Reset the timer if low speed
        if (self->mode == LEDC_LOW_SPEED_MODE) {
            check_esp_err(ledc_timer_rst(self->mode, self->timer));
        }

        configure_channel(self);
        register_channel(self->mode, self->channel, self->pin, self->timer);

        // Save the same duty cycle when frequency is changed
        set_duty(self);
    } else {
        set_duty(self);
    }
}

// Find a free PWM channel, also spot if our pin is already mentioned.
STATIC int find_channel(int mode, int pin) {
    MP_PRN(MP_PRN_TRACE, "find_channel(mode=%d pin=%d)", mode, pin)
    int avail_channel = -1;
    for (int channel = 0; channel < LEDC_CHANNEL_MAX; ++channel) {
        if (chans[mode][channel].pin == pin) {
            return channel;
        }
        if ((avail_channel < 0) && (chans[mode][channel].pin < 0)) {
            avail_channel = channel;
        }
    }
    return avail_channel;
}

STATIC int find_new_channel(machine_pwm_obj_t *self) {
    MP_PRN(MP_PRN_TRACE, "find_new_channel()")
    int channel = -1;
    for (int mode = 0; mode < LEDC_SPEED_MODE_MAX; ++mode) {
        ////if (is_free_channel(mode)) {
            channel = find_channel(mode, self->pin);
            if (channel >= 0) {
                self->mode = mode;
                break;
            }
        ////}
    }
    if (channel < 0) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("1 out of PWM channels:%d"), PWM_CHANNEL_MAX); // in all modes
    }
    return channel;
}

STATIC int find_free_timer_in_mode(machine_pwm_obj_t *self, int check_mode) {
    MP_PRN(MP_PRN_TRACE, "find_free_timer_in_mode(%d)", check_mode)
    for (int mode = 0; mode < LEDC_SPEED_MODE_MAX; ++mode) {
        if ((check_mode < 0) || is_free_channel(check_mode, self->pin)) {
            for (int timer = 0; timer < LEDC_TIMER_MAX; ++timer) {
                if ((check_mode < 0) || (check_mode == mode)) {
                    if (timers[mode][timer].freq_hz == 0) {
                        self->mode = mode;
                        return timer;
                    }
                }
            }
        }
    }
    return -1;
}

// Return timer with the same mode and frequency
STATIC int find_timer(int mode, unsigned int freq) {
    MP_PRN(MP_PRN_TRACE, "find_timer(mode=%d freq=%d)", mode, freq)
    for (int timer = 0; timer < LEDC_TIMER_MAX; ++timer) {
        if (timers[mode][timer].freq_hz == freq) {
            return timer;
        }
    }
    return -1;
}
/*
If the frequency is changed, try to find a timer with the same frequency
in the current mode, otherwise in the next mode.
If the mode is changed, release the channel and select a new channel in the next mode.
Then set the frequency with the same duty.
*/
STATIC void select_a_timer(machine_pwm_obj_t *self, int freq) {
    MP_PRN(MP_PRN_TRACE, "select_a_timer(freq=%d mode=%d)", freq, self->mode)
    if ((freq <= 0) || (freq > 40000000)) {
        mp_raise_ValueError(MP_ERROR_TEXT("frequency must be from 1Hz to 40MHz"));
    }

    int save_timer = self->timer;
    int save_channel = self->channel;
    int save_mode = self->mode;
    if (self->mode < 0) {
        self->mode = 0;
    }

    // Check if an already running timer with the required frequency is running in the same mode
    int new_timer = -1;
    //if (is_free_channel(self->mode)) {
        new_timer = find_timer(self->mode, freq);
    //}
    if (save_mode >= 0) {
        if (!is_free_channel(self->mode, self->pin)) {
            // There is a timer, but there is no channel
            new_timer = -1;
        }
    }

    // If no existing timer and channel was found in the same mode, then find a new one in another mode
    int new_mode = self->mode;
    if (new_timer < 0) {
        // Calc next mode
        if (new_mode > 0) {
            --new_mode;
        } else if (new_mode < (LEDC_SPEED_MODE_MAX - 1)) {
            ++new_mode;
        }

